app/views/trains/_form.html.erb

    <%= f.label :route, 'Текущий маршрут' %>
    <%= f.collection_select :route_id, Route.all, :id, :name %>
---
SELECT "routes".* FROM "routes"