app/views/tickets/_form.html.erb

SELECT "railway_stations".* FROM "railway_stations"
---
      <%= f.label :railway_station_start_id, 'Начальная станция' %>
      <%= f.collection_select :railway_station_start_id, RailwayStation.all, :id, :title %>