app/views/wagons/_form.html.erb

      <strong><%= f.label :train, 'Прикрепить вагон к поезду:' %></strong>
      <%= f.collection_select :train_id, Train.all, :id, :number %>
---
SELECT "trains".* FROM "trains"