app/views/wagons/show.html.erb

  <strong>Прикреплен к поезду</strong>
  <% if @wagon.train.present? %>
---
SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT 1  [["id", 1]]