app/controllers/railway_stations_controller.rb

SELECT "railway_stations".* FROM "railway_stations"
---
  def index
    @railway_stations = RailwayStation.all

INSERT INTO "railway_stations" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Минск"], ["created_at", "2019-03-27 10:43:34.232531"], ["updated_at", "2019-03-27 10:43:34.232531"]]
---
  def create
    @railway_station = RailwayStation.new(railway_station_params)

    respond_to do |format|
      if @railway_station.save

SELECT  "railway_stations".* FROM "railway_stations" WHERE "railway_stations"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_railway_station
      @railway_station = RailwayStation.find(params[:id])