app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("number", "railway_station_start_id", "railway_station_end_id", "user_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @ticket = Ticket.new(ticket_params)
    if @ticket.save