app/controllers/trains_controller.rb

  def create
    @train = Train.new(train_params)

     if @train.save
---
INSERT INTO "trains" ("number", "sort_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["number", "123123"], ["sort_by", "asc"], ["created_at", "2019-03-27 10:43:52.034285"], ["updated_at", "2019-03-27 10:43:52.034285"]]

    def set_train
      @train = Train.find(params[:id])
---
SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT 1  [["id", 1]]