app/controllers/wagons_controller.rb

    def index
      @wagons = Wagon.all
---
SELECT "wagons".* FROM "wagons"

    def create
      @wagon = set_class_name.new(wagon_params)
      if @wagon.save
---
INSERT INTO "wagons" ("type", "train_id", "top_seats", "lower_seats", "side_top_seats", "side_bottom_seats", "seating", "number", "wagon_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_wagon
      @wagon =  Wagon.find(params[:id])
---
SELECT  "wagons".* FROM "wagons" WHERE "wagons"."id" = ? LIMIT 1  [["id", 1]]